youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio_interface.cpp
/*
 *  Copyright (c) 2025, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   This file implements the shared radio interface layer that provides common RAIL operations
 *   and hardware abstraction used across multiple radio modules (radio.cpp, radio_energy_scan.cpp, etc.).
 */

#include "radio_interface.h"

#include <openthread-core-config.h>
#include <openthread/platform/alarm-micro.h>
#include <openthread/platform/radio.h>
#include <openthread/platform/time.h>

#include "common/code_utils.hpp"
#include "common/debug.hpp"
#include "common/logging.hpp"
#include "utils/link_metrics.h"

#include "platform-efr32.h"
#include "radio_channel_switching.h"
#include "radio_events.h"
#include "radio_instance.h"
#include "radio_power_manager.h"
#include "radio_security.h"
#include "radio_state.h"

#include "soft_source_match_table.h"
#include <openthread/link.h>
#include "utils/code_utils.h"
#include "utils/mac_frame.h"

extern "C" {
#include "rail_config.h"
#include "sl_openthread_radio_config.h"
#include "sl_rail.h"
#include "sl_rail_ieee802154.h"
#include "sl_rail_util_compatible_pa.h"
#if defined(_SILICON_LABS_32B_SERIES_2)
#include "em_system.h"
#else
#include "sl_hal_system.h"
#endif

#ifdef SL_CATALOG_RAIL_UTIL_COEX_PRESENT
#include "coexistence-802154.h"
#include "coexistence-ot.h"
#endif

#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
#include "sl_rail_mux_rename.h"
#endif

#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
#include "sl_rail_util_ant_div.h"
#include "sl_rail_util_ant_div_config.h"
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
#include "sl_rail_util_ieee802154_phy_select.h"
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
} // extern "C"

#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
sl_rail_handle_t gRailHandle;
#else
sl_rail_handle_t emPhyRailHandle;
#endif

efr32BandConfig *sCurrentBandConfig = nullptr;

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
struct efr32RadioCounters railDebugCounters;
#endif

static constexpr uint8_t CCA_THRESHOLD_DEFAULT = -75; // dbm - default for 2.4GHz 802.15.4

static efr32CommonConfig sCommonConfig;
static efr32BandConfig   sBandConfig;
static int8_t            sCcaThresholdDbm = CCA_THRESHOLD_DEFAULT;

const sl_rail_ieee802154_config_t sRailIeee802154Config = {
    .p_addresses = nullptr,
    .ack_config =
        {
            .enable         = true,
            .ack_timeout_us = 672,
            .rx_transitions =
                {
                    .success = SL_RAIL_RF_STATE_RX,
                    .error   = SL_RAIL_RF_STATE_RX,
                },
            .tx_transitions =
                {
                    .success = SL_RAIL_RF_STATE_RX,
                    .error   = SL_RAIL_RF_STATE_RX,
                },
        },
    .timings =
        {
            .idle_to_rx = 100,
            .tx_to_rx   = 192 - 10,
            .idle_to_tx = 100,
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
            .rx_to_tx = 256, // accommodate enhanced ACKs
#else
            .rx_to_tx = 192,
#endif
            .rxsearch_timeout       = 0,
            .tx_to_rxsearch_timeout = 0,
            .tx_to_tx               = 0,
        },
    .frames_mask                            = SL_RAIL_IEEE802154_ACCEPT_STANDARD_FRAMES,
    .promiscuous_mode                       = false,
    .is_pan_coordinator                     = false,
    .default_frame_pending_in_outgoing_acks = false,
};

// External function declarations
extern void sli_update_tx_power_after_config_update(sl_rail_tx_pa_mode_t pa_mode, int8_t aTxPower);
extern void sli_set_tx_power_in_rail(int8_t aTxPower);

// External functions from radio.cpp
extern bool sl_rail_util_coex_is_enabled(void);

static otRadioCaps sRadioCapabilities =
    (OT_RADIO_CAPS_ACK_TIMEOUT | OT_RADIO_CAPS_CSMA_BACKOFF | OT_RADIO_CAPS_ENERGY_SCAN | OT_RADIO_CAPS_SLEEP_TO_TX
#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
     | OT_RADIO_CAPS_TRANSMIT_SEC
     // When scheduled tx is required, we support sl_rail_start_scheduled_cca_csma_tx
     // (delay is indicated in tx frame info set in MAC)
     | OT_RADIO_CAPS_TRANSMIT_TIMING
     // When scheduled rx is required, we support sl_rail_start_scheduled_rx in our
     // implementation of otPlatRadioReceiveAt
     | OT_RADIO_CAPS_RECEIVE_TIMING
#endif
    );

static bool sPromiscuous       = false;
static bool sIsSrcMatchEnabled = false;
static bool sRadioCoexEnabled  = true;

// Constants needed for moved functions
#ifndef USERDATA_MFG_CUSTOM_EUI_64
#define USERDATA_MFG_CUSTOM_EUI_64 (2)
#endif

#ifndef OT_EXT_ADDRESS_SIZE
#define OT_EXT_ADDRESS_SIZE (8)
#endif

// Device capability macro for MCU enable check
#if defined(_SILICON_LABS_32B_SERIES_2)
#define DEVICE_CAPABILITY_MCU_EN (DEVINFO->SWCAPA1 & _DEVINFO_SWCAPA1_RFMCUEN_MASK)
#else
#define DEVICE_CAPABILITY_MCU_EN (DEVINFO->SWCAPA & _DEVINFO_SWCAPA_RFMCUEN_MASK)
#endif

//------------------------------------------------------------------------------
// Function Implementations

// Functions moved from radio.cpp
#if RADIO_CONFIG_ENABLE_CUSTOM_EUI_SUPPORT && defined(_SILICON_LABS_32B_SERIES_2)

