youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio_interface.cpp
#ifndef USERDATA_END
#define USERDATA_END (USERDATA_BASE + FLASH_PAGE_SIZE)
#endif

/*
 * This API reads the UserData page on the given EFR device.
 */
static int readUserData(void *aBuffer, uint16_t aIndex, int aLen, bool aChangeByteOrder)
{
    const uint8_t *readLocation  = (uint8_t *)USERDATA_BASE + aIndex;
    uint8_t       *writeLocation = (uint8_t *)aBuffer;

    // Sanity check to verify if the ouput buffer is valid and the index and len are valid.
    // If invalid, change the len to -1 and return.
    otEXPECT_ACTION((writeLocation != nullptr) && ((readLocation + aLen) <= (uint8_t *)USERDATA_END), aLen = -1);

    // Copy the contents of flash into output buffer.

    for (int idx = 0; idx < aLen; idx++)
    {
        if (aChangeByteOrder)
        {
            writeLocation[idx] = readLocation[(aLen - 1) - idx];
        }
        else
        {
            writeLocation[idx] = readLocation[idx];
        }
    }

exit:
    // Return len, len was changed to -1 to indicate failure.
    return aLen;
}
#endif

#ifdef SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT
void sli_ot_radio_interface_init_antenna_config(void)
{
    sl_rail_status_t status;
    sl_rail_util_ant_div_init();
    status = sl_rail_util_ant_div_update_antenna_config();
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
}
#endif // SL_CATALOG_RAIL_UTIL_ANT_DIV_PRESENT

sl_rail_handle_t sli_ot_radio_interface_get_rail_handle(void)
{
#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
    return gRailHandle;
#else
    return emPhyRailHandle;
#endif
}

efr32BandConfig *sli_ot_radio_interface_get_current_band_config(void)
{
    return sCurrentBandConfig;
}

efr32CommonConfig *sli_ot_radio_interface_get_common_config_ptr(void)
{
    return &sCommonConfig;
}

efr32BandConfig *sli_ot_radio_interface_get_band_config_ptr(void)
{
    return &sBandConfig;
}

otError sli_ot_radio_interface_set_rx(uint8_t aChannel)
{
    otError          error = OT_ERROR_NONE;
    sl_rail_status_t status;

    sl_rail_scheduler_info_t bgRxSchedulerInfo = {.priority         = SL_802154_RADIO_PRIO_BACKGROUND_RX_VALUE,
                                                  .slip_time        = 0,
                                                  .transaction_time = 0};

#if FAST_CHANNEL_SWITCHING_SUPPORT && OPENTHREAD_CONFIG_MULTIPLE_INSTANCE_ENABLE
    if (sli_ot_radio_channel_switching_is_multi_channel_enabled())
    {
        // Calling sl_rail_start_rx with a channel not listed in the channel
        // switching config is a bug.
        OT_ASSERT(sli_ot_radio_channel_switching_get_channel_index(aChannel) != INVALID_INTERFACE_INDEX);

        sli_ot_radio_state_set_idle();
        status = sl_rail_ieee802154_config_rx_channel_switching(gRailHandle,
                                                                sli_ot_radio_channel_switching_get_config_ptr());
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
        status = sl_rail_config_rx_options(gRailHandle,
                                           SL_RAIL_RX_OPTION_CHANNEL_SWITCHING,
                                           SL_RAIL_RX_OPTION_CHANNEL_SWITCHING);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
    }
    else
    {
        status = sl_rail_config_rx_options(gRailHandle, SL_RAIL_RX_OPTION_CHANNEL_SWITCHING, SL_RAIL_RX_OPTIONS_NONE);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
    }
#endif

    status = sl_rail_start_rx(gRailHandle, aChannel, &bgRxSchedulerInfo);
    if (status != SL_RAIL_STATUS_NO_ERROR)
    {
        error = OT_ERROR_FAILED;
        return error;
    }

    sli_ot_radio_events_handle_phy_stack_event(SL_RAIL_UTIL_IEEE802154_STACK_EVENT_RX_LISTEN, 0U);

    otLogInfoPlat("State=OT_RADIO_STATE_RECEIVE");

    return error;
}

bool sli_ot_radio_interface_is_busy(void)
{
    return sli_ot_radio_state_is_transmitting_or_scanning();
}

void sli_ot_radio_interface_set_idle(sl_rail_handle_t aRailHandle, sl_rail_idle_mode_t aIdleMode, bool aWait)
{
    sl_rail_idle(aRailHandle, aIdleMode, aWait);
}

sl_rail_status_t sli_ot_radio_interface_config_rx_options(sl_rail_rx_options_t aOptions, sl_rail_rx_options_t aMask)
{
    return sl_rail_config_rx_options(gRailHandle, aOptions, aMask);
}

int16_t sli_ot_radio_interface_get_rssi(bool aWait)
{
    return sl_rail_get_rssi(gRailHandle, aWait ? SL_RAIL_GET_RSSI_WAIT_WITHOUT_TIMEOUT : SL_RAIL_GET_RSSI_NO_WAIT);
}

uint32_t sli_ot_radio_interface_get_symbol_rate(void)
{
    return sl_rail_get_symbol_rate(gRailHandle);
}

sl_rail_status_t sli_ot_radio_interface_set_timer(struct sl_rail_multi_timer    *aTimer,
                                                  sl_rail_time_t                 aTime,
                                                  sl_rail_time_mode_t            aMode,
                                                  sl_rail_multi_timer_callback_t aCallback,
                                                  void                          *aCallbackArg)
{
    return sl_rail_set_multi_timer(gRailHandle, aTimer, aTime, aMode, aCallback, aCallbackArg);
}

void sli_ot_radio_interface_cancel_timer(struct sl_rail_multi_timer *aTimer)
{
    sl_rail_cancel_multi_timer(gRailHandle, aTimer);
}

efr32BandConfig *sli_ot_radio_interface_get_band_config(uint8_t aChannel)
{
    efr32BandConfig *config = nullptr;

    if (!((sBandConfig.mChannelMin <= aChannel) && (aChannel <= sBandConfig.mChannelMax)))
    {
        return nullptr;
    }
    config = &sBandConfig;

    return config;
}

void sli_ot_radio_interface_load_rail_config(efr32BandConfig *aBandConfig, int8_t aTxPower)
{
    sl_rail_status_t     status;
    sl_rail_tx_pa_mode_t pa_mode = SL_RAIL_TX_PA_MODE_INVALID;

    if (aBandConfig->mChannelConfig != nullptr)
    {
        status = sl_rail_ieee802154_set_phy_id(gRailHandle, RAIL_IEEE802154_PTI_RADIO_CONFIG_915MHZ_R23_NA_EXT);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
        status = sl_rail_config_channels(gRailHandle, aBandConfig->mChannelConfig, nullptr);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
        uint16_t firstChannel = sl_rail_get_first_channel(gRailHandle, aBandConfig->mChannelConfig);
        OT_ASSERT(firstChannel == aBandConfig->mChannelMin);
        status = sl_rail_prepare_channel(gRailHandle, firstChannel);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
        status = sl_rail_ieee802154_config_g_options(gRailHandle,
                                                     SL_RAIL_IEEE802154_G_OPTION_GB868,
                                                     SL_RAIL_IEEE802154_G_OPTION_GB868);
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

        pa_mode = SL_RAIL_TX_PA_MODE_SUB_GHZ;
    }
    else
    {
#if defined(SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT)
        status = sl_rail_util_ieee802154_config_radio(gRailHandle);
#else
        status = sl_rail_ieee802154_config_2p4_ghz_radio(gRailHandle);
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
        OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

        pa_mode = SL_RAIL_TX_PA_MODE_2P4_GHZ;
    }

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
    // 802.15.4E support (only on platforms that support it, so error checking is disabled)
    // Note: This has to be called after sl_rail_ieee802154_config_2p4_ghz_radio due to a bug where this call
    // can overwrite options set below.
    sl_rail_ieee802154_config_e_options(gRailHandle,
                                        (SL_RAIL_IEEE802154_E_OPTION_GB868 | SL_RAIL_IEEE802154_E_OPTION_ENH_ACK),
                                        (SL_RAIL_IEEE802154_E_OPTION_GB868 | SL_RAIL_IEEE802154_E_OPTION_ENH_ACK));
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

    if (aTxPower != SL_INVALID_TX_POWER)
    {
        sli_update_tx_power_after_config_update(pa_mode, aTxPower);
    }

    // Set the current band config
    sCurrentBandConfig = aBandConfig;
}

otError sli_ot_radio_interface_load_channel_config(uint8_t aChannel, int8_t aTxPower)
{
    otError          error      = OT_ERROR_NONE;
    efr32BandConfig *bandConfig = sli_ot_radio_interface_get_band_config(aChannel);

    otEXPECT_ACTION(bandConfig != nullptr, error = OT_ERROR_INVALID_ARGS);

