youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio_interface.cpp
    otEXPECT_ACTION(bandConfig != sCurrentBandConfig, sli_ot_radio_interface_set_tx_power(aTxPower));

    sli_ot_radio_interface_rail_idle();
    sli_ot_radio_interface_load_rail_config(bandConfig, aTxPower);

exit:
    return error;
}

void sli_ot_radio_interface_init_config(void)
{
    // Initialize band config with proper channel range
#if RADIO_CONFIG_2P4GHZ_OQPSK_SUPPORT
    sBandConfig.mChannelConfig = nullptr;
    sBandConfig.mChannelMin    = OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN; // 11
    sBandConfig.mChannelMax    = OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MAX; // 26
#else
    sBandConfig.mChannelConfig = channelConfigs[0];
    sBandConfig.mChannelMin    = SL_CHANNEL_MIN;
    sBandConfig.mChannelMax    = SL_CHANNEL_MAX;
#endif
}

void sli_ot_radio_interface_deinit_config(void)
{
    // Clear the current band config
    sCurrentBandConfig = nullptr;
}

sl_rail_status_t sli_ot_radio_interface_rail_config_cca_mode(uint8_t aCcaMode)
{
    return sl_rail_ieee802154_config_cca_mode(gRailHandle, aCcaMode);
}

sl_rail_status_t sli_ot_radio_interface_set_cca_mode(uint8_t aCcaMode)
{
    return sli_ot_radio_interface_rail_config_cca_mode(aCcaMode);
}

void sli_ot_radio_interface_set_tx_power(int8_t aTxPower)
{
    sli_set_tx_power_in_rail(aTxPower);
}

void sli_ot_radio_interface_set_current_band_config(efr32BandConfig *aBandConfig)
{
    sCurrentBandConfig = aBandConfig;
}

int8_t sli_ot_radio_interface_get_cca_threshold(void)
{
    return sCcaThresholdDbm;
}

void sli_ot_radio_interface_set_cca_threshold(int8_t aThreshold)
{
    sCcaThresholdDbm = aThreshold;
}

// These functions provide direct access to RAIL operations while keeping gRailHandle
// encapsulated within this single file.

// RAIL state management functions
sl_rail_status_t sli_ot_radio_interface_rail_idle(void)
{
    return sl_rail_idle(gRailHandle, SL_RAIL_IDLE, true);
}

sl_rail_status_t sli_ot_radio_interface_rail_idle_abort(void)
{
    return sl_rail_idle(gRailHandle, SL_RAIL_IDLE_ABORT, true);
}

sl_rail_status_t sli_ot_radio_interface_rail_yield_radio(void)
{
    return sl_rail_yield_radio(gRailHandle);
}

sl_rail_radio_state_t sli_ot_radio_interface_rail_get_radio_state(void)
{
    return sl_rail_get_radio_state(gRailHandle);
}

// RAIL TX operations
sl_rail_status_t sli_ot_radio_interface_rail_start_tx(uint8_t                         aChannel,
                                                      sl_rail_tx_options_t            aOptions,
                                                      const sl_rail_scheduler_info_t *aScheduler)
{
    return sl_rail_start_tx(gRailHandle, aChannel, aOptions, aScheduler);
}

sl_rail_status_t sli_ot_radio_interface_rail_start_cca_csma_tx(uint8_t                         aChannel,
                                                               sl_rail_tx_options_t            aOptions,
                                                               const sl_rail_csma_config_t    *aCsmaConfig,
                                                               const sl_rail_scheduler_info_t *aScheduler)
{
    return sl_rail_start_cca_csma_tx(gRailHandle, aChannel, aOptions, aCsmaConfig, aScheduler);
}

sl_rail_status_t sli_ot_radio_interface_rail_start_scheduled_cca_csma_tx(
    uint8_t                              aChannel,
    sl_rail_tx_options_t                 aOptions,
    const sl_rail_scheduled_tx_config_t *aScheduledConfig,
    const sl_rail_csma_config_t         *aCsmaConfig,
    const sl_rail_scheduler_info_t      *aScheduler)
{
    return sl_rail_start_scheduled_cca_csma_tx(gRailHandle,
                                               aChannel,
                                               aOptions,
                                               aScheduledConfig,
                                               aCsmaConfig,
                                               aScheduler);
}

sl_rail_status_t sli_ot_radio_interface_rail_write_tx_fifo(const uint8_t *aData, uint16_t aLength, bool aReset)
{
    return sl_rail_write_tx_fifo(gRailHandle, aData, aLength, aReset);
}

// RAIL IEEE 802.15.4 operations
sl_rail_status_t sli_ot_radio_interface_rail_set_pan_id(uint16_t aPanId, uint8_t aPanIndex)
{
    return sl_rail_ieee802154_set_pan_id(gRailHandle, aPanId, aPanIndex);
}

sl_rail_status_t sli_ot_radio_interface_rail_set_long_address(const uint8_t *aAddress, uint8_t aPanIndex)
{
    return sl_rail_ieee802154_set_long_address(gRailHandle, aAddress, aPanIndex);
}

sl_rail_status_t sli_ot_radio_interface_rail_set_short_address(uint16_t aAddress, uint8_t aPanIndex)
{
    return sl_rail_ieee802154_set_short_address(gRailHandle, aAddress, aPanIndex);
}

sl_rail_status_t sli_ot_radio_interface_rail_set_promiscuous_mode(bool aEnable)
{
    return sl_rail_ieee802154_set_promiscuous_mode(gRailHandle, aEnable);
}

// RAIL packet operations
sl_rail_rx_packet_handle_t sli_ot_radio_interface_rail_get_rx_packet_info(sl_rail_rx_packet_handle_t aHandle,
                                                                          sl_rail_rx_packet_info_t  *aPacketInfo)
{
    return sl_rail_get_rx_packet_info(gRailHandle, aHandle, aPacketInfo);
}

sl_rail_status_t sli_ot_radio_interface_rail_copy_rx_packet(uint8_t                        *aBuffer,
                                                            const sl_rail_rx_packet_info_t *aPacketInfo)
{
    return sl_rail_copy_rx_packet(gRailHandle, aBuffer, aPacketInfo);
}

sl_rail_status_t sli_ot_radio_interface_rail_get_rx_packet_details(sl_rail_rx_packet_handle_t   aHandle,
                                                                   sl_rail_rx_packet_details_t *aPacketDetails)
{
    return sl_rail_get_rx_packet_details(gRailHandle, aHandle, aPacketDetails);
}

// RAIL utility functions
uint32_t sli_ot_radio_interface_rail_get_symbol_rate(void)
{
    return sl_rail_get_symbol_rate(gRailHandle);
}

uint32_t sli_ot_radio_interface_rail_get_bit_rate(void)
{
    return sl_rail_get_bit_rate(gRailHandle);
}

uint16_t sli_ot_radio_interface_rail_get_channel_value(void)
{
    uint16_t channel;
    sl_rail_get_channel(gRailHandle, &channel);
    return channel;
}

int16_t sli_ot_radio_interface_rail_get_rssi(sl_rail_time_t aWaitTimeoutUs)
{
    return sl_rail_get_rssi(gRailHandle, aWaitTimeoutUs);
}

// RAIL timing configuration access
uint32_t sli_ot_radio_interface_rail_get_rx_to_tx_timing(void)
{
    return sRailIeee802154Config.timings.rx_to_tx;
}

// RAIL configuration
sl_rail_status_t sli_ot_radio_interface_rail_config_channels(
    const sl_rail_channel_config_t         *aChannels,
    sl_rail_radio_config_changed_callback_t aConfigChangedCallback)
{
    return sl_rail_config_channels(gRailHandle, aChannels, aConfigChangedCallback);
}

sl_rail_status_t sli_ot_radio_interface_rail_config_events(sl_rail_events_t aEvents, sl_rail_events_t aMask)
{
    return sl_rail_config_events(gRailHandle, aEvents, aMask);
}

sl_rail_status_t sli_ot_radio_interface_rail_config_sleep(const sl_rail_timer_sync_config_t *aTimerSyncConfig)
{
    return sl_rail_config_sleep(gRailHandle, aTimerSyncConfig);
}

sl_rail_status_t sli_ot_radio_interface_rail_config_rx_options(sl_rail_rx_options_t aOptions,
                                                               sl_rail_rx_options_t aMask)
{
    return sl_rail_config_rx_options(gRailHandle, aOptions, aMask);
}

// Additional RAIL power management functions
sl_rail_status_t sli_ot_radio_interface_rail_set_tx_power_dbm(sl_rail_tx_power_t aPowerDbm)
{
    return sl_rail_set_tx_power_dbm(gRailHandle, aPowerDbm);
}

sl_rail_tx_pa_mode_t sli_ot_radio_interface_rail_get_tx_pa_mode(void)
{
    return sl_rail_get_pa_mode(gRailHandle);
}

sl_rail_tx_power_t sli_ot_radio_interface_rail_get_tx_power_dbm(void)
{
    return sl_rail_get_tx_power_dbm(gRailHandle);
}

