youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio_interface.cpp
sl_rail_status_t sli_ot_radio_interface_rail_config_tx_power(sl_rail_tx_pa_mode_t pa_mode)
{
    return sl_rail_util_pa_post_init(gRailHandle, pa_mode);
}

void sli_ot_radio_interface_rail_get_channel_ptr(uint16_t *aChannel)
{
    sl_rail_get_channel(gRailHandle, aChannel);
}

// Additional RAIL functions needed for radio.cpp
sl_rail_status_t sli_ot_radio_interface_rail_get_rx_incoming_packet_info(sl_rail_rx_packet_info_t *aPacketInfo)
{
    return sl_rail_get_rx_incoming_packet_info(gRailHandle, aPacketInfo);
}

sl_rail_status_t sli_ot_radio_interface_rail_start_scheduled_rx(uint8_t                              aChannel,
                                                                const sl_rail_scheduled_rx_config_t *aConfig,
                                                                const sl_rail_scheduler_info_t      *aScheduler)
{
    return sl_rail_start_scheduled_rx(gRailHandle, aChannel, aConfig, aScheduler);
}

sl_rail_handle_t sli_ot_radio_interface_rail_init(efr32CommonConfig *aCommonConfig)
{
    sl_rail_status_t status;
    sl_rail_handle_t handle = SL_RAIL_EFR32_HANDLE;

#if !OPENTHREAD_RADIO
    OT_ASSERT(DEVICE_CAPABILITY_MCU_EN);
#endif

    aCommonConfig->mRailConfig.rx_packet_queue_entries = sl_rail_builtin_rx_packet_queue_entries;
    aCommonConfig->mRailConfig.p_rx_packet_queue       = sl_rail_builtin_rx_packet_queue_ptr;

    aCommonConfig->mRailConfig.rx_fifo_bytes    = sl_rail_builtin_rx_fifo_bytes;
    aCommonConfig->mRailConfig.p_rx_fifo_buffer = sl_rail_builtin_rx_fifo_ptr;

    aCommonConfig->mRailConfig.tx_fifo_bytes    = sizeof(aCommonConfig->mRailTxFifo.fifo);
    aCommonConfig->mRailConfig.p_tx_fifo_buffer = (sl_rail_fifo_buffer_align_t *)aCommonConfig->mRailTxFifo.fifo;

    status = sl_rail_init(&handle, &aCommonConfig->mRailConfig, nullptr);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
    status = sl_rail_init_power_manager();
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);
#endif // SL_CATALOG_POWER_MANAGER_PRESENT

    status = sl_rail_config_cal(handle, SL_RAIL_CAL_ALL);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    status = sl_rail_set_pti_protocol(handle, SL_RAIL_PTI_PROTOCOL_THREAD);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    status = sl_rail_ieee802154_init(handle, &sRailIeee802154Config);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

#if (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)
    // Enhanced Frame Pending
    status = sl_rail_ieee802154_enable_early_frame_pending(handle, true);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    status = sl_rail_ieee802154_enable_data_frame_pending(handle, true);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

    // Initialize security module
    sli_ot_radio_security_init();
#endif // (OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2)

    // Enable RAIL multi-timer
    sl_rail_config_multi_timer(handle, true);

    gRailHandle = handle;
    OT_ASSERT(gRailHandle != nullptr);
    return gRailHandle;
}

bool sli_ot_radio_interface_rail_is_receiving_frame(void)
{
    return (sl_rail_get_radio_state(gRailHandle) & SL_RAIL_RF_STATE_RX_ACTIVE) == SL_RAIL_RF_STATE_RX_ACTIVE;
}

// Additional RAIL functions for remaining radio.cpp references
bool sli_ot_radio_interface_rail_is_rx_auto_ack_paused(void)
{
    return sl_rail_is_rx_auto_ack_paused(gRailHandle);
}

sl_rail_status_t sli_ot_radio_interface_rail_get_rx_time_sync_word_end(sl_rail_rx_packet_details_t *aPacketDetails)
{
    return sl_rail_get_rx_time_sync_word_end(gRailHandle, aPacketDetails);
}

uint32_t sli_ot_radio_interface_rail_get_phy_id(void)
{
    return sl_rail_ieee802154_get_phy_id(gRailHandle);
}

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
sl_rail_status_t sli_ot_radio_interface_rail_config_radio(void)
{
    sl_rail_status_t status;
#if defined(SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT)
    status = sl_rail_util_ieee802154_config_radio(gRailHandle);
#else
    status = sl_rail_ieee802154_config_2p4_ghz_radio(gRailHandle);
#endif
    return status;
}
#endif // SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT

sl_rail_status_t sli_ot_radio_interface_rail_pause_rx_auto_ack(bool aPause)
{
    return sl_rail_pause_rx_auto_ack(gRailHandle, aPause);
}

void sli_ot_radio_interface_rail_set_coex_counter_handler(void *aHandler)
{
#ifdef SL_CATALOG_RAIL_MULTIPLEXER_PRESENT
    sl_rail_mux_set_coex_counter_handler(gRailHandle, (COEX_CounterHandler_t)aHandler);
#else
    OT_UNUSED_VARIABLE(aHandler);
#endif
}

sl_rail_status_t sli_ot_radio_interface_rail_set_cca_threshold(int8_t aThreshold)
{
    return sl_rail_set_cca_threshold(gRailHandle, aThreshold);
}

sl_rail_status_t sli_ot_radio_interface_rail_get_channel(uint16_t *aChannel)
{
    return sl_rail_get_channel(gRailHandle, aChannel);
}

sl_rail_status_t sli_ot_radio_interface_rail_start_tx_stream(uint8_t               aChannel,
                                                             sl_rail_stream_mode_t aMode,
                                                             sl_rail_tx_options_t  aOptions)
{
    return sl_rail_start_tx_stream(gRailHandle, aChannel, aMode, aOptions);
}

sl_rail_status_t sli_ot_radio_interface_rail_stop_tx_stream(void)
{
    return sl_rail_stop_tx_stream(gRailHandle);
}

sl_rail_status_t sli_ot_radio_interface_rail_start_rx(uint8_t aChannel, const sl_rail_scheduler_info_t *aScheduler)
{
    return sl_rail_start_rx(gRailHandle, aChannel, aScheduler);
}

//------------------------------------------------------------------------------
// OpenThread Platform Radio API Functions (Instance-Independent)
// These functions don't use the otInstance parameter and can be moved here

uint64_t otPlatRadioGetNow(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return otPlatTimeGet();
}

void otPlatRadioGetIeeeEui64(otInstance *aInstance, uint8_t *aIeeeEui64)
{
    OT_UNUSED_VARIABLE(aInstance);

#if (RADIO_CONFIG_ENABLE_CUSTOM_EUI_SUPPORT) && defined(_SILICON_LABS_32B_SERIES_2)
    // Invalid EUI
    uint8_t nullEui[] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU};

