youxia173/KAJEN_F_CICDTest/ZigbeeMatterLight_113W/simplicity_sdk_2025.12.1/openthread/platform-abstraction/efr32/radio_interface.cpp
    // Read the Custom EUI and compare it to nullEui
    if ((readUserData(aIeeeEui64, USERDATA_MFG_CUSTOM_EUI_64, OT_EXT_ADDRESS_SIZE, true) == -1)
        || (memcmp(aIeeeEui64, nullEui, OT_EXT_ADDRESS_SIZE) == 0))
#endif
    {
        uint64_t       eui64;
        const uint8_t *eui64Ptr = nullptr;

#if defined(_SILICON_LABS_32B_SERIES_2)
        eui64 = SYSTEM_GetUnique();
#else
        eui64 = sl_hal_system_get_unique();
#endif
        eui64Ptr = (const uint8_t *)&eui64;

        for (uint8_t i = 0; i < OT_EXT_ADDRESS_SIZE; i++)
        {
            aIeeeEui64[i] = eui64Ptr[(OT_EXT_ADDRESS_SIZE - 1) - i];
        }
    }
}

otRadioState otPlatRadioGetState(otInstance *aInstance)
{
    otRadioState radioState = OT_RADIO_STATE_INVALID;

    OT_UNUSED_VARIABLE(aInstance);

    switch (sli_ot_radio_interface_rail_get_radio_state())
    {
    case SL_RAIL_RF_STATE_RX:
    case SL_RAIL_RF_STATE_RX_ACTIVE:
        radioState = OT_RADIO_STATE_RECEIVE;
        break;

    case SL_RAIL_RF_STATE_TX:
    case SL_RAIL_RF_STATE_TX_ACTIVE:
        radioState = OT_RADIO_STATE_TRANSMIT;
        break;

    case SL_RAIL_RF_STATE_IDLE:
        radioState = OT_RADIO_STATE_SLEEP;
        break;

    case SL_RAIL_RF_STATE_INACTIVE:
        radioState = OT_RADIO_STATE_DISABLED;
        break;
    default:
        break;
    }

    return radioState;
}

bool otPlatRadioIsEnabled(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return (sli_ot_radio_state_is_initialized());
}

otError otPlatRadioSleep(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    otError error = OT_ERROR_NONE;

    otEXPECT(!sli_ot_radio_state_is_tx_data_ongoing());

    otLogInfoPlat("State=OT_RADIO_STATE_SLEEP");
    sli_ot_radio_state_set_scheduled_rx_pending(false);
    sli_ot_radio_state_set_idle();

exit:
    return error;
}

otRadioCaps otPlatRadioGetCaps(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return sli_ot_radio_interface_get_capabilities();
}

bool otPlatRadioGetPromiscuous(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return sli_ot_radio_interface_get_promiscuous();
}

void otPlatRadioSetPromiscuous(otInstance *aInstance, bool aEnable)
{
    sl_rail_status_t status;

    otEXPECT(sl_ot_rtos_task_can_access_pal());

    sli_ot_radio_interface_set_promiscuous(aEnable);

    status = sli_ot_radio_interface_rail_set_promiscuous_mode(aEnable);
    OT_ASSERT(status == SL_RAIL_STATUS_NO_ERROR);

exit:
    OT_UNUSED_VARIABLE(aInstance);
    return;
}

void otPlatRadioEnableSrcMatch(otInstance *aInstance, bool aEnable)
{
    otEXPECT(sl_ot_rtos_task_can_access_pal());

    // set Frame Pending bit for all outgoing ACKs if aEnable is false
    sli_ot_radio_interface_set_src_match_enabled(aEnable);

exit:
    OT_UNUSED_VARIABLE(aInstance);
    return;
}

otError otPlatRadioGetTransmitPower(otInstance *aInstance, int8_t *aPower)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(aPower != nullptr, error = OT_ERROR_INVALID_ARGS);
    // sl_rail_get_tx_power_dbm() returns power in deci-dBm (0.1dBm)
    // Divide by 10 because aPower is supposed be in units dBm
    *aPower = static_cast<int8_t>(sli_ot_radio_interface_rail_get_tx_power_dbm());

exit:
    return error;
}

otError otPlatRadioGetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t *aThreshold)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error = OT_ERROR_NONE;
    otEXPECT_ACTION(aThreshold != nullptr, error = OT_ERROR_INVALID_ARGS);

    *aThreshold = sli_ot_radio_interface_get_cca_threshold();

exit:
    return error;
}

otError otPlatRadioSetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t aThreshold)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);
    sli_ot_radio_interface_set_cca_threshold(aThreshold);

exit:
    return error;
}

int8_t otPlatRadioGetReceiveSensitivity(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return SL_OPENTHREAD_RECEIVE_SENSITIVITY;
}

uint8_t otPlatRadioGetCslAccuracy(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return static_cast<uint8_t>(otPlatTimeGetXtalAccuracy());
}

uint8_t otPlatRadioGetCslUncertainty(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return SL_OPENTHREAD_CSL_TX_UNCERTAINTY;
}

bool otPlatRadioIsCoexEnabled(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return (sRadioCoexEnabled && sl_rail_util_coex_is_enabled());
}

//------------------------------------------------------------------------------
// Accessor functions for global variables moved from radio.cpp

otRadioCaps sli_ot_radio_interface_get_capabilities(void)
{
    return sRadioCapabilities;
}

bool sli_ot_radio_interface_get_promiscuous(void)
{
    return sPromiscuous;
}

void sli_ot_radio_interface_set_promiscuous(bool aEnable)
{
    sPromiscuous = aEnable;
}

bool sli_ot_radio_interface_is_src_match_enabled(void)
{
    return sIsSrcMatchEnabled;
}

void sli_ot_radio_interface_set_src_match_enabled(bool aEnable)
{
    sIsSrcMatchEnabled = aEnable;
}

bool sli_ot_radio_interface_is_coex_enabled(void)
{
    return sRadioCoexEnabled;
}

void sli_ot_radio_interface_set_coex_enabled(bool aEnable)
{
    sRadioCoexEnabled = aEnable;
}

//------------------------------------------------------------------------------
// Link Metrics Enhanced ACK Probing

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
otError otPlatRadioConfigureEnhAckProbing(otInstance          *aInstance,
                                          otLinkMetrics        aLinkMetrics,
                                          const otShortAddress aShortAddress,
                                          const otExtAddress  *aExtAddress)
{
    otError error;

    OT_UNUSED_VARIABLE(aInstance);
    otEXPECT_ACTION(sl_ot_rtos_task_can_access_pal(), error = OT_ERROR_REJECTED);

    error = otLinkMetricsConfigureEnhAckProbing(aShortAddress, aExtAddress, aLinkMetrics);

exit:
    return error;
}
#endif // OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

//------------------------------------------------------------------------------
// PTI Radio Configuration

sl_rail_ieee802154_phy_t sli_ot_radio_interface_get_pti_radio_config(void)
{
    return static_cast<sl_rail_ieee802154_phy_t>(sli_ot_radio_interface_rail_get_phy_id());
}

//------------------------------------------------------------------------------
// Radio Debug Counters

#if RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
otError sli_ot_radio_interface_get_radio_counters(efr32RadioCounters *aRadioCounters)
{
    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(aRadioCounters != nullptr, error = OT_ERROR_INVALID_ARGS);
    *aRadioCounters = railDebugCounters;

exit:
    return error;
}

void sli_ot_radio_interface_clear_radio_counters(void)
{
    memset(&railDebugCounters, 0, sizeof(railDebugCounters));
}
#endif // RADIO_CONFIG_DEBUG_COUNTERS_SUPPORT
